Revit 2024 API
MEPSpaceConstruction Methods
The MEPSpaceConstruction type exposes the following members.
Methods
Name | Description
DeleteConstruction
Remove an existing construction from Space constructions.
DuplicateConstruction
Create a new construction for Space constructions.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
NewConstruction
Create a new construction for Space constructions.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace